# CSCI 490 Assignment 2
#### Instructor: Dr. David Koop
#### Programmer: Dominykas Karalius
#### Due at 11:59pm on Friday, February 7
#### Z1809478

Downloads the .csv file of the hurricane data and creates a dataFrame object from that .csv file, using ',' as a delimiter.

In [305]:
import os
from urllib.request import urlretrieve

# download the data if we don't have it locally
url = "http://faculty.cs.niu.edu/~dakoop/cs680-2020sp/a2/hurdat2.csv"
local_fname = "hurdat2.csv"
if not os.path.exists("hurdat2.csv"):
    urlretrieve(url, local_fname)

In [306]:
import pandas as pd

df = pd.read_csv('hurdat2.csv', delimiter=',')

# 1.)
### Hurricane Names (15 pts)
We again wish to compute the number of unique hurricane names and the most frequently used name. First, we must load the data. Pandas has a read_csv method that will load a dataset into a DataFrame object. Recall that we have the hurricane’s name and identifier repeated for each point it was tracked in this dataset. For this part of the analysis, we do not want to have these repeats. Pandas allows us to remove them by (a) projecting the hurricanes to just the identifiers and names and (b) removing duplicates. For (a), you can select a subset of columns using brackets, and multiple columns using a list inside the brackets. For example,

  new_df = df[[col1,col2]]
creates a new dataframe new_df with only columns col1 and col2. For (b), you can use the drop_duplicates method.

In [307]:
new_df = df[['identifier','name']]
new_df = new_df.drop_duplicates
new_df

<bound method DataFrame.drop_duplicates of       identifier     name
0       AL011851  UNNAMED
1       AL011851  UNNAMED
2       AL011851  UNNAMED
3       AL011851  UNNAMED
4       AL011851  UNNAMED
...          ...      ...
51341   AL162018    OSCAR
51342   AL162018    OSCAR
51343   AL162018    OSCAR
51344   AL162018    OSCAR
51345   AL162018    OSCAR

[51346 rows x 2 columns]>

## Part a
### Number of Unique Hurricane Names
Using your projected, de-duped data frame, compute the number of unique hurricane names. Remember to remove UNNAMED!

Creates a new dataFrame object from the previously generated dataFrame object, however does NOT include hurricanes with the name "UNNAMED". We then use the len() method along with the unique() method to find the number of unique hurricane names in the dataFrame object.

In [308]:
df = df[df['name'] != 'UNNAMED']
uniqueName = len(df.name.unique())
print("Number of unique hurricane names:",uniqueName)

Number of unique hurricane names: 288

## Part b
### Most frequently used name
Using the same data frame, compute the most frequently used name.

Creates a variable that will be used to hold name of the most frequent hurricane name. This is done, by using the value_counts() and idxmax() methods together.

In [309]:
freqName = df['name'].value_counts().idxmax()
print("Most Frequently Used Name:",freqName)

Most Frequently Used Name: FLORENCE

# 2.)
### Year with the Most Hurricanes (10 pts)
Now, we need the year with the most hurricanes. Here, we need to have some way to extract the year from the rest of the data. There are (at least) two ways to do this: (a) extract it from the identifier, and (b) extract it from the datetime. For (a), we use pandas string methods on an entire column at once. For example, df.col1.str[:2] extracts the first two characters of col1. For (b), we need to ensure that datetime is understood as a pandas datetime type. This can be accomplished by converting a column using pd.to_datetime method and then using the .dt accessor. For example, pd.to_datetime(col1).dt.month converts a column to datetime and then extracts the month.

In both cases, we need to create a new column to store the year. Once you have done this, drop the duplicates to ensure we don’t double-count hurricanes and count the number of occurrences per year.

Create a new dataFrame object to be used in problem 2. We then drop_duplicates() so we have no repeating hurricane entries. We then retrieve the datetime entry for each hurricane, but only the first four values, which are the year, using str[:4]. We then use the value_counts() and idxmax() methods together to find the year with the most hurricanes.

In [310]:
df2 = df[['identifier', 'datetime']]
df2 = df2.drop_duplicates()
print("Year with Most Hurricanes:", df2.datetime.str[:4].value_counts().idxmax())

Year with Most Hurricanes: 2005

# 3.)
### Minimum latitude and Minimum pressure (15 pts)
Now, we will use all of the points that were tracked for the hurricanes to find the hurricane with the maximum latitude and minimum pressure. This time, we don’t need to worry about dropping duplicates. However, if we just use the max and min descriptive statistics, we will only get the values instead of the details about the hurricane name and year. We can either use boolean indexing to find matching values or use the idxmin or idxmax methods to obtain the index of the row that achieves the maximum and then pull out that row.

Create a new dataFrame object to be used in problem 3 with identifier, name, num_pts, latitude, min_pressure, and datetime values. Print to check.

In [311]:
df3 = df[['identifier', 'name', 'num_pts', 'latitude', 'min_pressure', 'datetime']]
df3

      identifier   name  num_pts  latitude  min_pressure             datetime
21879   AL011950   ABLE       51      17.1          -999  1950-08-12T00:00:00
21880   AL011950   ABLE       51      17.7          -999  1950-08-12T06:00:00
21881   AL011950   ABLE       51      18.2          -999  1950-08-12T12:00:00
21882   AL011950   ABLE       51      19.0          -999  1950-08-12T18:00:00
21883   AL011950   ABLE       51      20.0          -999  1950-08-13T00:00:00
...          ...    ...      ...       ...           ...                  ...
51341   AL162018  OSCAR       36      57.9           960  2018-11-03T12:00:00
51342   AL162018  OSCAR       36      58.9           964  2018-11-03T18:00:00
51343   AL162018  OSCAR       36      59.8           968  2018-11-04T00:00:00
51344   AL162018  OSCAR       36      60.8           973  2018-11-04T06:00:00
51345   AL162018  OSCAR       36      62.4           977  2018-11-04T12:00:00

[24540 rows x 6 columns]

## Part a
### Farthest South Hurricane Name and Year
Find the name, year, and latitude of the hurricane that was tracked farthest south.

We find the minimum value of latitude using the idxmin() method and set that value to index. We use index, to pull out the record and find the name, latitude, and year of the hurricane.

In [312]:
index = df3.latitude.idxmin()

nameMinLat = df3.name.loc[index]
minLat = df3.latitude.loc[index]
yearMinLat = df3.datetime.str[:4].loc[index]

print("Most Southerly Hurricane was", nameMinLat, "in", yearMinLat, "with a latitude of", minLat, "N.")

Most Southerly Hurricane was ISIDORE in 1990 with a latitude of 7.2 N.

## Part b
### b. Hurricane with Minimum Pressure
Find the name, year, and pressure of the hurricane that had minimum pressure. Make sure to exclude -999 values!

We create a new dataFrame object from our previously generated dataFrame object, but do NOT include -999 values for the minimum pressure. We then find the minimum pressure using the idxmin() method and set that value to index. We use index, to pull out the record and find the name, minimum pressure, and year of the hurricane.

In [313]:
df3 = df3[df3['min_pressure'] != -999]
index = df3.min_pressure.idxmin()

nameMinPressure = df3.name.loc[index]
minPressure = df3.min_pressure.loc[index]
yearMinPressure = df3.datetime.str[:4].loc[index]

print("Hurricane with minimum pressure was", nameMinPressure , "in", yearMinPressure, "with a pressure of", minPressure, "millibars.")

Hurricane with minimum pressure was WILMA in 2005 with a pressure of 882 millibars.

# 4.)
### Year-month Crosstab (15 pts)
Pandas features crosstabs so that we can also create a table to analyze the number of hurricanes over years and months. Here, we need the ability to extract both year and month so option (b) from Part 2 is best. Then, the pd.crosstab method allows us to pass in both year and month to obtain the table. Add margins=True to get subtotals for rows and columns.

Create a completely new dataFrame object for problem 4 using the same .csv file. We drop the duplicates to prevent repeated entries. We then add two new values to each hurricane, year and month. We get these values by converting the datetime value to datetime and using the .dt accessor method to get the year and month. We then create a final dataFrame object, that only has the year and month values shown. We create a crosstab using our last dataFrame object.

In [314]:
df4 = pd.read_csv('hurdat2.csv', delimiter=',')
df4 = df4.drop_duplicates()
df4['year'] = pd.to_datetime(df4['datetime']).dt.year
df4['month'] = pd.to_datetime(df4['datetime']).dt.month
df5 = df4[['year','month']]

pd.crosstab(df5['year'],df5['month'], margins = True)

month,1,2,3,4,5,6,7,8,9,10,11,12,All
year,,,,,,,,,,,,,
1851,0,0,0,0,0,14,2,49,16,17,0,0,98
1852,0,0,0,0,0,0,0,45,64,25,0,0,134
1853,0,0,0,0,0,0,0,10,74,16,0,0,100
1854,0,0,0,0,0,11,0,1,36,12,0,0,60
1855,0,0,0,0,0,0,0,24,11,0,0,0,35
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2015,0,0,0,0,28,22,15,55,140,59,20,0,339
2016,42,0,0,0,20,63,0,126,194,103,38,0,586
2017,0,0,0,27,0,29,22,126,292,93,21,0,610
2018,0,0,0,0,26,0,102,57,278,130,15,0,608
All,174,13,14,108,701,2461,3440,11224,19831,10203,2683,494,51346

# 5.) 
### [Extra Credit] Incorrect Values (20 pts)
The dataset is mostly correct, but there are a couple of interesting errors.

Create a new dataFrame object for problem 5. Display only the identifier, name, status, and datetime entries. Drop duplicates to prevent repeated entries. Print to double check if everything works.

In [315]:
df5 = pd.read_csv('hurdat2.csv', delimiter=',')
df5 = df5[['identifier', 'name', 'status', 'datetime']]
df5 = df5.drop_duplicates()
df5

      identifier     name status             datetime
0       AL011851  UNNAMED     HU  1851-06-25T00:00:00
1       AL011851  UNNAMED     HU  1851-06-25T06:00:00
2       AL011851  UNNAMED     HU  1851-06-25T12:00:00
3       AL011851  UNNAMED     HU  1851-06-25T18:00:00
4       AL011851  UNNAMED     HU  1851-06-25T21:00:00
...          ...      ...    ...                  ...
51341   AL162018    OSCAR     EX  2018-11-03T12:00:00
51342   AL162018    OSCAR     EX  2018-11-03T18:00:00
51343   AL162018    OSCAR     EX  2018-11-04T00:00:00
51344   AL162018    OSCAR     EX  2018-11-04T06:00:00
51345   AL162018    OSCAR     EX  2018-11-04T12:00:00

[51346 rows x 4 columns]

## Part a
### Incorrect Status (7 pts)
There is (at least) one error with one of the entries in the status column. Consult the documentation to see which hurricane status codes are allowed, and find both the anomalous code and the name & year of the hurricane that was incorrectly tagged.

Create a list of accepted status codes and check every entry that does NOT have these as a status code. Return the name, code, and year of the hurricane with the incorrect code. Print.

In [320]:
acceptedValues = ['TD', 'TS', 'HU', 'EX', 'SD', 'SS', 'LO', 'WV', 'DB']
df5 = df5[~df5['status'].isin(acceptedValues)]

name = df5.iloc[0]['name']
code = df5.iloc[0]['status']
year = df5.iloc[0]['datetime']
year = year[:4]

print("Hurricane with incorrect status code was", name , "in", year, "with a status code of", code, ".")

Hurricane with incorrect status code was HARVEY in 1993 with a status code of ET .

## Part b
### b. Incorrect Max Wind Flag (13 pts)
Check the record_id codes in the documentation. One of those codes flags the time that the hurricane reached its maximum sustained wind speed. However, one of the hurricanes has a reported maximum sustained wind speed (the max_wind column) that is higher than the flagged record. Identify the hurricane as well as that hurricane’s real maximum wind speed.

We start off be reading the .csv again to have a clear record. We then print out the entries that have a 'W' value, so that we may record the identifier, which we will use later. We cannot record the names, because there are multiple hurricanes named 'BARRY'.

We then create a list of those identifiers and create a for loop. We iterate through every identifier that we previously recorded to have a "W" in the record_id value. We record the real max wind speed and the max wind speed that is presented on the "W" record_id value. We then compare those values for each identifier. If they are equal, we continue, if not, we print out an error message and the hurricane name, the incorrect max speed, and correct max speed.

In [321]:
df5b = pd.read_csv('hurdat2.csv', delimiter=',')
df5b = df5b[['identifier', 'name', 'record_id', 'max_wind','datetime']]
df5b = df5b[df5b['record_id'] == 'W']
df5b

      identifier     name record_id  max_wind             datetime
38322   AL111991    GRACE         W        90  1991-10-29T14:00:00
39123   AL021995    BARRY         W        60  1995-07-07T21:00:00
43730   AL062004  FRANCES         W       125  2004-09-02T07:30:00
46675   AL112009      IDA         W        75  2009-11-09T21:00:00

In [322]:
identifierList = []
for index, row in df5b.head().iterrows():
    identifierList.append(row['identifier']) 

for i in identifierList:
    df6 = pd.read_csv('hurdat2.csv', delimiter=',')
    df6 = df6[df6['identifier'] == i ]
    realMaxSpeed = df6['max_wind'].max()
    df6 = df6[df6['record_id'] == 'W']
    maxSpeed = df6['max_wind'].max()
    if maxSpeed < realMaxSpeed:
        name = df6.iloc[0]['name']
        print("Incorrect value found!")
        print("Hurricane", name, "had an incorrect max speed entry of", maxSpeed, ". The real max speed of hurricane", name, "is", realMaxSpeed, ".")

Incorrect value found!
Hurricane IDA had an incorrect max speed entry of 75 . The real max speed of hurricane IDA is 90 .